---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
source: html/52513d12-1571-fab9-06c7-c474bb18124a.htm
---
# AnalysisDisplayLegend Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.